app/controllers/ideas_controller.rb

  def create
    20.times do |index|
      MyWorker.perform_in(index, "Insert", index)
    end

    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save
---
INSERT INTO "ideas" ("created_at", "description", "name", "picture", "updated_at") VALUES (?, ?, ?, ?, ?)